lyricStr = """[00:00.06]︿☆光辉岁月(国语)☆︿
[00:00.75]
[00:01.03]演唱：BEYOND
[00:02.26]
[00:03.35]→网赚哥QQ：129 9734 652 分享歌词←
[00:07.13]
[00:08.10]www.90lrc.cn ★【歌词网】
[00:09.32]
[00:28.07]一生要走多远的路程
[00:33.03]经过多少年 才能走到终点
[00:40.23]
[00:41.51]梦想需要多久的时间
[00:46.04]多少血和泪 才能慢慢实现
[00:53.14]
[00:54.31]天地间任我展翅高飞
[01:00.73]谁说那是天真的预言
[01:06.74]风中挥舞狂乱的双手
[01:10.98]写下灿烂的诗篇
[01:14.20]不管有多么疲倦
[01:20.01]潮来潮往 世界多变迁
[01:23.98]迎接光辉岁月
[01:26.76]为它一生奉献
[01:30.92]
[01:42.72]一生要走多远的路程
[01:47.62]经过多少年 才能走到终点
[01:55.76]孤独地生活黑色世界
[02:00.60]只要肯期待 希望不会幻灭
[02:07.71]
[02:08.90]天地间任我展翅高飞
[02:15.18]谁说那是天真的预言
[02:46.57]
[03:47.22][03:22.35][02:45.57][02:20.71]
[03:59.20][03:23.35][02:21.90]风中挥舞狂乱的双手
[04:03.01][03:27.19][02:25.60]写下灿烂的诗篇
[04:06.14][03:30.39][02:28.77]不管有多么疲倦
[04:12.19][03:36.22][02:34.69]潮来潮往 世界多变迁
[04:15.83][03:40.19][02:38.67]迎接光辉岁月
[04:19.12][03:43.38][02:41.79]为它一生奉献
[04:23.12]→网赚哥QQ：129 9734 652 分享歌词←
"""
lrcDict = {}
lyricStrs = lyricStr.splitlines()
for line in lyricStrs:
    lines = line.split(']')
    for index in range(len(lines)-1):
       timeStr = lines[index][1:]
       timeList = timeStr.split(':')
       # 把时间变为小数
       time = float(timeList[0]) * 60 + float(timeList[1])
       lrcDict[time] = lines[-1]
for key,value in lrcDict.items():
    print('%.2f:%s' %(key,value))

